[
    {
        "slug": "lantern",
        "title": "Lantern",
        "image": "lantern-main.jpg",
        "date": "2015",
        "type": "iOS app & objet connecté",
        "text": "Lantern est mon projet final réalisé à l'école des Gobelins. C'est une veilleuse connectée qui produit du son et des lumières en fonction d'une histoire lue sur tablette.",
        "website": "http://lantern-app.com",
        "context": "Projet de 8 mois aux Gobelins",
        "technologies": "Objective-C, Arduino",
        "role": "Développeuse iOS",
        "content": [
            {
                "type": "image",
                "image": "lantern-top.jpg"
            },
            {
                "type": "text",
                "title": "But du projet",
                "text": "Avant d'aller se coucher, les enfants ont souvent peur de quitter leurs parents. Certains enfants essayent de faire durer le moment du coucher le plus longtemps possible. Nous avons voulu créer une routine du coucher qui tente de résoudre ce problème. Elle regroupe deux solutions existantes : la lecture d'une histoire et la veilleuse.",
                "image": "lantern-drawing.png",
                "text-position": "left",
                "mask-mobile": true
            },
            {
                "type": "text",
                "title": "Choix d'une histoire",
                "text": "Balaye l'écran de droite à gauche pour naviguer entre les différentes histoires. Chaque couverture est représentée par des illustrations et des pictogrammes qui s'animent.",
                "text-mobile": "Balaye l'écran de droite à gauche pour naviguer entre les différentes histoires.",
                "text-position": "right",
                "video": "covers.mp4",
                "mockup": "ipad-portrait"
            },
            {
                "type": "image",
                "image": "lantern-on.jpg"
            },
            {
                "type": "text",
                "title": "Lecture de l'histoire",
                "text": "Balaye l'écran du bas vers le haut pour tourner les pages de l'histoire. A chaque fois que l'on change de page, la veilleuse diffuse une ambiance lumineuse et sonore correspondant aux péripéties du récit. On peut également appuyer sur une petite icône pour jouer une animation ponctuelle sur la veilleuse.",
                "text-mobile": "Chaque page de l'histoire correspond à une couleur et un fond sonore joués par la veilleuse.",
                "text-position": "right",
                "video": "reading.mp4",
                "mockup": "ipad-portrait"
            },
            {
                "type": "image",
                "image": "lantern-open.jpg"
            },
            {
                "type": "text",
                "title": "Mode nuit",
                "text": "Après la lecture de l'histoire, on peut choisir une mélodie et une durée. La veilleuse jouera le son et diffusera une lumière douce pendant le temps choisi pour aider à l'endormissement. La Lantern continuera d'accompagner l'enfant toute la nuit, comme une simple veilleuse.",
                "text-mobile": "Aidez votre enfant à s'endormir avec une douce mélodie.",
                "text-position": "left",
                "video": "sleep-mode.mp4",
                "mockup": "ipad-portrait"
            }
        ]
    },
    {
        "slug": "animooh",
        "title": "Animooh",
        "image": "animooh-main.jpg",
        "date": "2014",
        "type": "application iOS",
        "text": "Animooh est une application iPad destinée aux enfants qui leur permet de découvrir des animaux incroyables.",
        "website": "http://katiamoreira.fr/animooh",
        "context": "Projet de 3 mois aux Gobelins",
        "technologies": "Objective-C",
        "role": "développeuse iOS",
        "content": [
            {
                "type": "image",
                "image": "animooh-home-ipad.png"
            },
            {
                "type": "text",
                "title": "But du projet",
                "text": "Nous avons axé notre réflexion autour du thème de la <em>connaissance augmentée</em>. Nous avons décidé de créer une application qui rend l'apprentissage plus \"fun\" grâce à la vulgarisation scientifique et l'ajout d'interactions.",
                "text-position": "left",
                "image": "animooh-purpose.png",
                "modifier": "ipad-landscape",
                "mask-mobile": true
            },
            {
                "type": "block-image",
                "images": [
                    "animooh-elephant.png",
                    "animooh-starfish.png"
                ],
                "modifier": "ipad-landscape"
            },
            {
                "type": "text",
                "title": "Jouer avec les animaux",
                "text": "Chaque animal présenté dans l'application possède une capacité extraordinaire. L'enfant doit jouer avec l'animal pour découvrir en quoi elle consiste.",
                "text-mobile": "Joue avec l'animal et devine quelle est sa capacité extraordinaire.",
                "text-position": "left",
                "video": "interaction.mp4",
                "mockup": "ipad-landscape"
            },
            {
                "type": "text",
                "title": "Comprendre le fonctionnement",
                "text": "Chaque capacité est expliquée à l'aide de schémas ou de petites interactions. Le but était de rendre les explications scientifiques accessibles aux enfants. Une voix-off et des sous-titres sont aussi là pour les aider.",
                "text-mobile": "Chaque capacité est expliquée à l'aide de schémas et d'interactions.",
                "text-position": "right",
                "video": "setules.mp4",
                "mockup": "ipad-landscape"
            },
            {
                "type": "video-player",
                "source": "vimeo",
                "id": "96509404"
            },
            {
                "type": "text",
                "title": "(Re)découvrir les animaux",
                "text": "Nous avons choisi une dizaine d'animaux incroyables : découvrez la crevette-pistolet ou la pieuvre mimétique. Les parents pourraient apprendre autant de choses que leur enfant... ",
                "text-mobile": "Nous avons choisi une dizaine d'animaux incroyables.",
                "text-position": "left",
                "image": "animooh-animals-list.png"
            }
        ]
    },
    {
        "slug": "simonpong",
        "title": "SimonPong",
        "image": "simonpong-main.jpg",
        "date": "2015",
        "type": "projet arduino",
        "text": "SimonPong est une table d'arcade créée durant un worksop arduino. Elle combine deux jeux existants : le simon et le pong",
        "context": "Workshop de 2 semaines aux Gobelins",
        "technologies": "Arduino, Processing",
        "role": "Développeuse (et menuisier)",
        "content": [
            {
                "type": "text",
                "title": "Contexte du projet",
                "text": "Le projet a été réalisé durant un workshop de 2 semaines à Gobelins : 1 semaine de conception et d'apprentissage de la technologie arduino, 1 semaine de réalisation. Le but du workshop était de créer un jeu multijoueur.",
                "text-mobile": "Le projet a été réalisé durant un workshop de 2 semaines.",
                "text-position": "left",
                "image": "simonpong-table.jpg"
            },
            {
                "type": "text",
                "title": "Fabrication",
                "text": "Nous n'avions qu'une semaine pour percer, poncer, peindre et fabriquer notre propre table d'arcade.",
                "text-mobile": "Nous n'avions qu'une semaine fabriquer notre propre table d'arcade.",
                "text-position": "right",
                "image": "simonpong-manufacturing.jpg"
            },
            {
                "type": "block-image",
                "images": [
                    "simonpong-pc.jpg",
                    "simonpong-manufacturing2.jpg"
                ]
            },
            {
                "type": "text",
                "title": "Développement",
                "text": "Nous avons codé le jeu avec Processing et les commandes à l'aide d'arduino. Nous avons utilisé 2 arduinos pour contrôler 16 boutons, 16 LEDs et 4 potentiomètres.",
                "text-mobile": "Nous avons codé le jeu avec Processing et les commandes à l'aide d'arduino.",
                "text-position": "left",
                "image": "simonpong-electronics.jpg"
            }
        ]

    },
    {
        "slug": "trust",
        "title": "Trust",
        "image": "trust-main.jpg",
        "date": "2014",
        "type": "application iOS",
        "text": "Trust est une application mobile qui permet de mieux comprendre l'actualité grâce à une timeline.",
        "context": "Workshop d'une semaime à Amsterdam et 3 mois de réalisation aux Gobelins",
        "technologies": "Objective-C",
        "role": "développeuse iOS",
        "content": [
            {
                "type": "text",
                "title": "But du projet",
                "text": "Le projet a été proposé par la Thomson Reuters Foundaiton aux étudiants de Gobelins. Le but était de créer une application à l'intention des <em>digital natives</em> pour leur donner envie de s'intéresser davantage à l'actualité. Nous avons créé une timeline qui permet à l'utilisateur de mieux comprendre l'actualité en ayant accès à tout son historique simplement.",
                "text-mobile": "Choisi un des thèmes d'actualité proposé.",
                "text-position": "left",
                "video": "covers.mp4",
                "mockup": "iphone-portrait"
            },
            {
                "type": "text",
                "title": "Découverte de la timeline",
                "text": "L'application ne propose que quelques thèmes d'actualité (3 par semaine) pour pouvoir se concentrer sur ceux-ci. Une fois le thème choisi o accède à sa timeline. Les contenus sont ordonnés de manière à comprendre l'historique de l'actualité et comment nous en sommes arrivés à la situation actuelle.",
                "text-mobile": "Accède à une timeline qui explique l'historique de l'actualité.",
                "text-position": "right",
                "video": "timeline.mp4",
                "mockup": "iphone-portrait"
            },
            {
                "type": "text",
                "title": "Accès à des articles liés",
                "text": "On peu choisir un article et simplement lire son contenu. Il contient des médias que l'on peut ouvrir dans une lightbox. A la fin de l'article on est amené à lire un autre article lié au contenu que nous venons de consulter.",
                "text-mobile": "Lit un article et accède à un contenu lié.",
                "text-position": "left",
                "video": "article.mp4",
                "mockup": "iphone-portrait"
            }
        ]

    },
    {
        "slug": "jocondelab",
        "title": "JocondeLab",
        "image": "jocondelab-main.jpg",
        "date": "2014",
        "type": "site internet",
        "text": "JocondeLab est un site internet qui aide les utilisateurs à organiser un voyage culturel en France en fonction de leurs préférences artistiques.",
        "context": "Projet de 4 mois aux Gobelins",
        "technologies": "AngularJS, HTML5/CSS3, Silex(PHP), Sphinx",
        "role": "Développeuse web",
        "content": [
            {
                "type": "text",
                "title": "But du projet",
                "text": "Le projet a été proposé par le ministère de la culture. Le but était d'utiliser une de leur base de données contenant des informations sur les musées français et et de créer une expérience ou un service.",
                "text-position": "left",
                "image": "jocondelab-home.jpg",
                "mask-mobile": true
            },
            {
                "type": "text",
                "title": "Choix d'une destination",
                "text": "Premièrement, il faut choisir une destination. Si vous ne savez pas ou allez choisissez simplement une ville de départ et la distance que vous souhaitez parcourir. Sinon sélectionnez directement une ville d'arrivée.",
                "text-mobile": "Commencez par choisir une destination.",
                "text-position": "right",
                "image": "jocondelab-destination.jpg"
            },
            {
                "type": "text",
                "title": "Indiquer ses goûts",
                "text": "Pour chaque proposition, indiquez si vous aimez ça ou non. J'ai développé un plugin JavaScript maison pour permettre l'affichage des images en accordéon.",
                "text-mobile": "Ensuite, indiquez vos goûts.",
                "text-position": "left",
                "image": "jocondelab-tastes.jpg"
            },
            {
                "type": "text",
                "title": "Choix des oeuvres",
                "text": "En fonction de vos goûts et de votres destination, l'application vous propose plusieurs oeuvres qui se trouvent des dans musées français. Indiquez que vous les aimez ou supprimez les. Vous aurez ensuite la possiblité de visiter des musées qui se situent sur votre pracours, de votre ville de départ à votre ville d'arrivée. Pour utiliser la base de données, très lourde, j'ai utilisé la bibilothèque de recherche Sphinx.",
                "text-position": "right",
                "text-mobile": "En fonction de vos goûts l'application vous propose certaines oeuvres à aller visiter.",
                "image": "jocondelab-like.jpg"
            }
        ]

    },
    {
        "slug": "iieplearning",
        "title": "IIEP Learning",
        "image": "iieplearning-main.jpg",
        "date": "2015",
        "type": "site internet",
        "text": "Le portail IIEP Learning est une plateforme de l'International Institute for Education Planning, organe de l'UNESCO. Il permet le développement des capacités des acteurs de l'éducation et une politique de partage des connaissances.",
        "context": "Projet professsionnel à Opsone",
        "technologies": "Symfony2, JavaScript, Solr",
        "role": "Développeuse web",
        "content": [
            {
                "type": "image",
                "image": "iieplearning-home.png"
            },
            {
                "type": "video",
                "mockup": "macbook",
                "video": "iieplearning-search.mp4"
            }
        ]
    }
]
